/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "L'operazione non è stata completata";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Si è verificato un errore sconosciuto (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Impossibile completare azione";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Riprova più tardi.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Impossibile registrare";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Prova a registrare di nuovo.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Impossibile registrare";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Interrompi tutte le altre azioni che usano %@ e riprova."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Impossibile registrare";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Prova a registrare di nuovo.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Registrazione interrotta";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Prova a registrare di nuovo.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Operazione interrotta";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Spazio insufficiente per continuare la scrittura documento. Libera dello spazio eliminando video o foto esistenti.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Registrazione interrotta";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Prova a registrare di nuovo.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Registrazione interrotta";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Prova a registrare di nuovo.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Registrazione interrotta";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "È stata raggiunta la lunghezza massima per la registrazione."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Registrazione interrotta";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Sono state raggiunte le dimensioni massime per la registrazione."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Registrazione interrotta";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Interrompi tutte le altre azioni che usano il dispositivo di registrazione e riprova.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Registrazione interrotta";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "È stata raggiunta la lunghezza massima per la registrazione."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Impossibile registrare";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Prova a registrare di nuovo.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Impossibile usare %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Interrompi tutte le altre azioni che usano %@ e riprova."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Impossibile usare %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Interrompi tutte le altre azioni che usano %@ e riprova."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Registrazione interrotta";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Interrompi tutte le altre azioni che usano il dispositivo di registrazione e riprova.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Impossibile completare azione";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Riprova più tardi.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Impossibile completare esportazione";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Prova a esportare più tardi.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Impossibile decodificare";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Impossibile decodificare i dati multimediali: possono essere danneggiati.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Impossibile aprire";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Il formato di questo media non è supportato.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Impossibile salvare";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Prova a salvare di nuovo.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Impossibile aprire";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Impossibile usare questo media.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Impossibile aprire";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Impossibile usare questo media.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Impossibile aprire";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Impossibile usare questo media.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Impossibile aprire";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Impossibile usare questo media.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Impossibile aprire";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Il formato di questo media non è supportato.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Impossibile aprire";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Il media potrebbe essere danneggiato.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Impossibile scattare foto";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Prova a scattare di nuovo una foto.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Operazione interrotta";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "L'operazione non è supportata per contenuti protetti."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Impossibile aprire";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Questo contenuto non è autorizzato."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Impossibile aprire";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "L'applicazione non è autorizzata a riprodurre questo documento."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Impossibile aprire";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Impossibile usare questo media.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Impossibile decodificare";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Impossibile trovare il decodificatore richiesto per il documento multimediale.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Impossibile decodificare";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Impossibile trovare il decodificatore richiesto per il documento multimediale.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Impossibile decodificare";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Il decodificatore richiesto per il documento multimediale è occupato.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Interrompi tutte le altre azioni che decodificano i documenti multimediali e riprova.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Impossibile decodificare";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Il codificatore richiesto per il documento multimediale è occupato.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Interrompi tutte le altre azioni che decodificano i documenti multimediali e riprova.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Impossibile usare %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "%@ non può essere usata da un app eseguita in background."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Operazione interrotta";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "L'operazione non è supportata per questi documenti multimediali.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Operazione interrotta";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Impossibile comporre il video attenendosi alle istruzioni fornite.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Impossibile aprire";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Impossibile usare questo media.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Operazione interrotta";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Impossibile utilizzare il documento cache all'URL di destinazione del download.";
